<template>
  <div id="index">
    <div class="tab">
      <div><a
          href="#"
          v-for="(item,index) in closeList"
          :key="index"
          @mouseover="show(index)"
        >{{item}}</a>
      </div>

    </div>
    <!-- 内容展示 -->
    <div
      class="content"
      v-show="contentShow"
    >
      <!-- 女装 -->
      <div>
        <ul>
          <li
            v-for="(item,index) in contentList"
            :key="index"
          >
            <h3>{{item.title}}</h3>
            <a
              href="#"
              v-for="(item1,index) in item.detail"
              :key="index"
            >{{item1}}</a>
          </li>
        </ul>
      </div>
    </div>
    <!-- <my-content></my-content> -->
  </div>
</template>
<script>

export default {
  name: 'index',
  data() {
    return {
      closeList: [],
      contentList: [],
      closes: [[
        { title: '女装', detail: ['韩版', '秋新品', '淘品牌', '90后潮流志', '连衣裙', '套装', '针织衫', '卫衣', '薄呢外套', '裤子', '衬衫', '风衣', '阔腿裤', '半身裙', 'T恤', '雪纺/蕾丝衫', '高腰裤'] },
        { title: '男装', detail: ['先型榜', '新品', '穿搭指南', '设计款', '线下大牌', '品质优选', 'T恤', '衬衫', '夹克', '卫衣', '皮衣', '休闲裤', '牛仔裤', '沙滩裤', '运动裤', '九分裤'] },
        {          title: '内衣', detail: [
            '抢新品', '薄款', '性感', '透视', '抹胸', '文胸', '发育期', '聚拢', '睡衣', '套装', '胖MM', '连体睡衣', '情侣睡衣', '女内裤', '男内裤', '丁字裤'
          ]
        }
      ], [
        { title: '数码', detail: ['韩版', '秋新品', '淘品牌', '90后潮流志', '连衣裙', '套装', '针织衫', '卫衣', '薄呢外套', '裤子', '衬衫', '风衣', '阔腿裤', '半身裙', 'T恤', '雪纺/蕾丝衫', '高腰裤'] },
        { title: '电器', detail: ['先型榜', '新品', '穿搭指南', '设计款', '线下大牌', '品质优选', 'T恤', '衬衫', '夹克', '卫衣', '皮衣', '休闲裤', '牛仔裤', '沙滩裤', '运动裤', '九分裤'] },
        {          title: '电子', detail: [
            '抢新品', '薄款', '性感', '透视', '抹胸', '文胸', '发育期', '聚拢', '睡衣', '套装', '胖MM', '连体睡衣', '情侣睡衣', '女内裤', '男内裤', '丁字裤'
          ]
        }
      ], [
        { title: '珠宝', detail: ['韩版', '秋新品', '淘品牌', '90后潮流志', '连衣裙', '套装', '针织衫', '卫衣', '薄呢外套', '裤子', '衬衫', '风衣', '阔腿裤', '半身裙', 'T恤', '雪纺/蕾丝衫', '高腰裤'] },
        { title: '眼镜', detail: ['先型榜', '新品', '穿搭指南', '设计款', '线下大牌', '品质优选', 'T恤', '衬衫', '夹克', '卫衣', '皮衣', '休闲裤', '牛仔裤', '沙滩裤', '运动裤', '九分裤'] },
        {          title: '手表', detail: [
            '抢新品', '薄款', '性感', '透视', '抹胸', '文胸', '发育期', '聚拢', '睡衣', '套装', '胖MM', '连体睡衣', '情侣睡衣', '女内裤', '男内裤', '丁字裤'
          ]
        }
      ], [
        { title: '童靴', detail: ['韩版', '秋新品', '淘品牌', '90后潮流志', '连衣裙', '套装', '针织衫', '卫衣', '薄呢外套', '裤子', '衬衫', '风衣', '阔腿裤', '半身裙', 'T恤', '雪纺/蕾丝衫', '高腰裤'] },
        { title: '箱包', detail: ['先型榜', '新品', '穿搭指南', '设计款', '线下大牌', '品质优选', 'T恤', '衬衫', '夹克', '卫衣', '皮衣', '休闲裤', '牛仔裤', '沙滩裤', '运动裤', '九分裤'] },
        {          title: '配件', detail: [
            '抢新品', '薄款', '性感', '透视', '抹胸', '文胸', '发育期', '聚拢', '睡衣', '套装', '胖MM', '连体睡衣', '情侣睡衣', '女内裤', '男内裤', '丁字裤'
          ]
        }
      ], [
        { title: '美妆', detail: ['韩版', '秋新品', '淘品牌', '90后潮流志', '连衣裙', '套装', '针织衫', '卫衣', '薄呢外套', '裤子', '衬衫', '风衣', '阔腿裤', '半身裙', 'T恤', '雪纺/蕾丝衫', '高腰裤'] },
        { title: '洗护', detail: ['先型榜', '新品', '穿搭指南', '设计款', '线下大牌', '品质优选', 'T恤', '衬衫', '夹克', '卫衣', '皮衣', '休闲裤', '牛仔裤', '沙滩裤', '运动裤', '九分裤'] },
        {          title: '保健品', detail: [
            '抢新品', '薄款', '性感', '透视', '抹胸', '文胸', '发育期', '聚拢', '睡衣', '套装', '胖MM', '连体睡衣', '情侣睡衣', '女内裤', '男内裤', '丁字裤'
          ]
        }
      ], [
        { title: '童装玩具', detail: ['韩版', '秋新品', '淘品牌', '90后潮流志', '连衣裙', '套装', '针织衫', '卫衣', '薄呢外套', '裤子', '衬衫', '风衣', '阔腿裤', '半身裙', 'T恤', '雪纺/蕾丝衫', '高腰裤'] },
        { title: '孕产', detail: ['先型榜', '新品', '穿搭指南', '设计款', '线下大牌', '品质优选', 'T恤', '衬衫', '夹克', '卫衣', '皮衣', '休闲裤', '牛仔裤', '沙滩裤', '运动裤', '九分裤'] },
        {          title: '用品', detail: [
            '抢新品', '薄款', '性感', '透视', '抹胸', '文胸', '发育期', '聚拢', '睡衣', '套装', '胖MM', '连体睡衣', '情侣睡衣', '女内裤', '男内裤', '丁字裤'
          ]
        }
      ], [
        { title: '运动', detail: ['韩版', '秋新品', '淘品牌', '90后潮流志', '连衣裙', '套装', '针织衫', '卫衣', '薄呢外套', '裤子', '衬衫', '风衣', '阔腿裤', '半身裙', 'T恤', '雪纺/蕾丝衫', '高腰裤'] },
        { title: '户外', detail: ['先型榜', '新品', '穿搭指南', '设计款', '线下大牌', '品质优选', 'T恤', '衬衫', '夹克', '卫衣', '皮衣', '休闲裤', '牛仔裤', '沙滩裤', '运动裤', '九分裤'] },
        {          title: '乐器', detail: [
            '抢新品', '薄款', '性感', '透视', '抹胸', '文胸', '发育期', '聚拢', '睡衣', '套装', '胖MM', '连体睡衣', '情侣睡衣', '女内裤', '男内裤', '丁字裤'
          ]
        }
      ], [
        { title: '工具', detail: ['韩版', '秋新品', '淘品牌', '90后潮流志', '连衣裙', '套装', '针织衫', '卫衣', '薄呢外套', '裤子', '衬衫', '风衣', '阔腿裤', '半身裙', 'T恤', '雪纺/蕾丝衫', '高腰裤'] },
        { title: '装修', detail: ['先型榜', '新品', '穿搭指南', '设计款', '线下大牌', '品质优选', 'T恤', '衬衫', '夹克', '卫衣', '皮衣', '休闲裤', '牛仔裤', '沙滩裤', '运动裤', '九分裤'] },
        {          title: '建材', detail: [
            '抢新品', '薄款', '性感', '透视', '抹胸', '文胸', '发育期', '聚拢', '睡衣', '套装', '胖MM', '连体睡衣', '情侣睡衣', '女内裤', '男内裤', '丁字裤'
          ]
        }
      ]
      ],
      contentShow: false,
      manList: [

      ],
      femaleList: [
        '先型榜', '新品', '穿搭指南', '设计款', '线下大牌', '品质优选', 'T恤', '衬衫', '夹克', '卫衣', '皮衣', '休闲裤', '牛仔裤', '沙滩裤', '运动裤', '九分裤'
      ],
      neiyiList: [
        '抢新品', '薄款', '性感', '透视', '抹胸', '文胸', '发育期', '聚拢', '睡衣', '套装', '胖MM', '连体睡衣', '情侣睡衣', '女内裤', '男内裤', '丁字裤'
      ]
    }
  },
  created() {
    var that = this;
    this.closes.forEach(function (val, index) {
      var str = '';
      for (let i = 0; i < val.length; i++) {
        if (i != val.length - 1) {
          //   this.closeList.unshift('/')
          str += val[i].title + '/'

        } else {
          str += val[i].title
        }
      }
      that.closeList.push(str)

    })
  },
  methods: {
    show(index) {
      console.log(index)
      this.contentShow = true;
      this.contentList = this.closes[index]
      console.log(this.contentList)

    },

  },

  components: {

  }
}

</script>
.<style scoped>
.tab {
  float: left;
  width: 150px;
  height: 300px;
  border: 1px solid red;
}

.tab a {
  display: inline-block;
  color: #000;
  text-decoration: none;
  line-height: 38px;
}
.tab a:hover {
  background: pink;
  color: orangered;
  text-decoration: underline;
}
.content {
  float: left;
  width: 600px;
  height: 300px;
  border: 2px solid red;
}
.content h3 {
  font: 600 16px "Microsoft YaHei";
}
.content ul {
  overflow: hidden;

  list-style-type: none;
}
.content ul li {
  margin-right: 10px;
  float: left;
}
.content ul li a {
  font-size: 14px;
  text-decoration: none;
  color: #000;
}
</style>
